app/controllers/api/v1/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
INSERT INTO "artworks" ("name", "description", "image_url", "status", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def index
        cli = Contract::Cli.new
        nft_list = []

        Artwork.all.each do |artwork|
            begin
                nft_list << cli.nft_data(artwork.id)

INSERT INTO "artworks" ("name", "description", "image_url", "status", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        cli = Contract::Cli.new
        errors_list = validate_params(params)
        return render_error(errors_list, 400) unless errors_list.empty?

        foundation = get_foundation

        artwork = Artwork.new(
            name: params[:name],
            description: params[:description],
            foundation_id: foundation.id
        )

        return render_error(artwork.errors.as_json.values.flatten, 400) unless artwork.save